Revit 2027 API
ControlledApplication.GetExtendedApiService<TService> Method
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TService GetExtendedApiService<TService>()
Public Function GetExtendedApiService(Of TService) As TService
public:
generic<typename TService>
TService GetExtendedApiService()
member GetExtendedApiService : unit -> 'TService
Type Parameters
TService
Return Value
TService
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace